In [6]:
import numpy as np
np.random.seed(12345)
np.set_printoptions(precision=4, suppress=True)

In [2]:
a =[]

In [8]:
import numpy as np
data = {i : np.random.randn() for i in range(7)}
data

{0: 0.2817461528302025,
 1: 0.7690225676118387,
 2: 1.2464347363862822,
 3: 1.0071893575830049,
 4: -1.2962211091122635,
 5: 0.274991633432124,
 6: 0.22891287893531592}

These are your notee

In [16]:
data[5]

0.274991633432124

In [18]:
a =[1,2,3,4,5]

In [20]:
a[4]

5

In [24]:
'a'

'a'

In [21]:
a= {
   'a' :12,
    'he': 13
}

In [22]:
a['he']

13

In [15]:
np.random.randn()

1.3529168351654497

In [25]:
b = [1, 2, 3]

In [26]:
b

[1, 2, 3]

In [27]:
b[1]

2

In [40]:
def joshif(x, y, z):
    print("function ran - message from inside of function")
    

    print ("end of the function")
    return (x + y) * z

In [41]:
joshif(2,3,6)

function ran - message from inside of function
end of the function

30

In [45]:
x = 6
y = 7
if x > 5:
    x += 1

    y = 8

In [46]:
x

7

In [47]:
y

8

In [48]:
a = [1, 2, 3]

In [49]:
b = a

In [50]:
a.append(4)

In [51]:
b

[1, 2, 3, 4]

In [52]:
b.pop()

4

In [53]:
b

[1, 2, 3]

In [54]:
b.pop(1)

2

In [55]:
b

[1, 3]

In [57]:
a = 5.1
type(a)

float

In [59]:
a = 'myname'
type(a)

str

In [60]:
a

'myname'

In [64]:
'5' + 5

TypeError: must be str, not int

In [65]:
a = 4.5
b = 2
# String formatting, to be visited later
print('a is {0}, b is {1}'.format(type(a), type(b)))

a is <class 'float'>, b is <class 'int'>

2.25

In [66]:
print('a, b is',type(a), type(b))

a, b is <class 'float'> <class 'int'>

In [67]:
type(a)

float

In [77]:
a = "Joshi's score"
isinstance(a, int)

False

In [78]:
type(a)

str

In [91]:
 a = 'foo           '

In [83]:
a.capitalize()

'Foo'

In [93]:
a.lstrip()

'foo           '

In [96]:
str = "     this is string example....wow!!!     ";
str.lstrip()

'this is string example....wow!!!     '

In [99]:
c = """
This is a longer string that

spans multiple lines
"""

In [100]:
c

'\nThis is a longer string that\n\nspans multiple lines\n'

In [101]:
c.count('\n')

4

In [103]:
a = 'this is a string'
#a[10] = 'f'
b = a.replace('string', 'longer string')
b

'this is a longer string'

In [4]:

a = 5.6
s = str(a)
s

'5.6'

s+1

In [6]:
s+"hi"

'5.6hi'

In [7]:
s=5.6

In [8]:
s = 'python'
list(s)

['p', 'y', 't', 'h', 'o', 'n']

In [9]:
s[:3]

'pyt'

In [13]:
s = 12/34
print(s)

0

In [21]:
s = 'this\has\no\special\characters'
s

'this\\has\no\\special\\characters'

In [24]:
a = 'this is the first half '
b = 'and this is the second half'
b +a

'and this is the second halfthis is the first half '

In [32]:
template = '{0:.2f} {1:s} are worth US${2:d}'

In [33]:
template

'{0:.2f} {1:s} are worth US${2:d}'

In [39]:
template.format(4.5560, 'Argentine Pesos', 43)

'4.56 Argentine Pesos are worth US$43'

In [28]:
'4.5560 Argentine Pesos are worth US$1'

'4.5560 Argentine Pesos are worth US$1'

In [40]:
s = '3.14159'
fval = float(s)

In [41]:
fval

3.14159

In [43]:
s = '3.14159'
fval = float(s)

In [44]:
a = None

In [45]:
a is None

True

In [46]:
a

In [47]:
b = 5

In [48]:
b is not None

True

In [49]:
def add_and_maybe_multiply(a, b, c=None): 
    result = a + b

    if c is not None:
        result = result * c

    return result

In [54]:
add_and_maybe_multiply(1,2,4)

12

In [59]:
type(None)

NoneType

In [3]:
from datetime import datetime, date, time
dt = datetime(2011, 10, 29, 20, 30, 21)
dt

datetime.datetime(2011, 10, 29, 20, 30, 21)

In [4]:
dt.day

29

In [5]:
dt.minute

30

In [6]:
dt.month

10

In [7]:
dt.strftime('%m/%d/%Y %I:%M %p')

'10/29/2011 08:30 PM'

In [8]:
datetime.strptime('20093110', '%Y%d%m')

datetime.datetime(2009, 10, 31, 0, 0)

In [9]:
dt.replace(minute=0, second=0)

datetime.datetime(2011, 10, 29, 20, 0)

In [10]:
dt2 = datetime(2011, 11, 15, 22, 30)
delta = dt2 - dt
delta

datetime.timedelta(17, 7179)

In [11]:
type(delta)

datetime.timedelta

In [12]:
dt2

datetime.datetime(2011, 11, 15, 22, 30)

In [13]:
dt

datetime.datetime(2011, 10, 29, 20, 30, 21)

In [25]:
a = 5
b = 7
c = 8 
d = 4

if (a < b) | (c > d):
    print('Made it')

Made it

In [21]:
4 > 3 > 2 > 1

True

In [26]:
if a < b or c > d:
    print('Made it')

Made it

In [27]:
for i in range(4):
    for j in range(4):
#         if j > i:
#             break
        print((i, j))

(0, 0)
(0, 1)
(0, 2)
(0, 3)
(1, 0)
(1, 1)
(1, 2)
(1, 3)
(2, 0)
(2, 1)
(2, 2)
(2, 3)
(3, 0)
(3, 1)
(3, 2)
(3, 3)

In [28]:
x = 256 
total = 0 

while x > 0: 
    if total > 400:
        break 
    total =total+ x 
    x = x / 2

In [29]:
x

4

In [30]:
total

504

In [31]:
range(10)
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [33]:
list(range(5, 0, -1))

[5, 4, 3, 2, 1]

In [41]:
sum = 0 
for i in range(10):

    # % is the modulo operator
    if i % 3 == 0 or i % 5 == 0:
        sum =sum + i
        print ("i",i)
        print ("sum",sum)

i 0
sum 0
i 3
sum 3
i 5
sum 8
i 6
sum 14
i 9
sum 23

In [37]:
sum

23

In [38]:
3+6+9+5

23

In [42]:
x = 5
'Non-negative' if x >= 0 else 'Negative'

'Non-negative'

In [47]:
if x >=-2
    print ('Non-negative') 
else:
    print('Negative')

Non-negative

In [49]:
for i in range(5,-5,-1):
    if i >=-2:
        print ('Non-negative') 
    else:
        print('Negative')

Non-negative
Non-negative
Non-negative
Non-negative
Non-negative
Non-negative
Non-negative
Non-negative
Negative
Negative

In [50]:
tup = 4, 5, 6
tup

(4, 5, 6)

In [55]:
tup[1]=1

TypeError: 'tuple' object does not support item assignment

In [57]:
tuple([4, 0, 2])

(4, 0, 2)

In [58]:
tup = tuple('string')
tup

('s', 't', 'r', 'i', 'n', 'g')

In [59]:
lst = list('string')
lst

['s', 't', 'r', 'i', 'n', 'g']

In [60]:
lst[0] ="x"

In [61]:
lst

['x', 't', 'r', 'i', 'n', 'g']

In [62]:
tup[1]='x'

TypeError: 'tuple' object does not support item assignment

In [63]:
a_list = [2, 3, 7, None]

In [65]:
a_list = [2, 3, 7, None]
tup = ('foo', 'bar', 'baz')
b_list = list(tup)
b_list

['foo', 'bar', 'baz']

In [67]:
b_list[1] = 'peekaboo'

In [68]:
b_list

['foo', 'peekaboo', 'baz']

In [ ]:
b_list[1] = 'peekaboo'
b_list

In [69]:
gen = range(10)
gen

range(0, 10)

In [70]:
list(gen)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [71]:
b_list.append('dwarf')
b_list

['foo', 'peekaboo', 'baz', 'dwarf']

In [72]:
b_list.insert(1, 'red')
b_list

['foo', 'red', 'peekaboo', 'baz', 'dwarf']

In [75]:
b_list.remove(1)

ValueError: list.remove(x): x not in list

In [74]:
b_list

['red', 'peekaboo', 'baz', 'dwarf']

In [79]:
'dwarf' in b_list

True

In [80]:
'dwarf' not in b_list

False

In [90]:
lst1 =[4, None, 'foo'] + [7, 8, [2, 3]]
lst1[5][1]

In [91]:
lst1

[4, None, 'foo', 7, 8, [2, 3]]

#

In [93]:
lst1

[4, None, 'foo', 7, 8, [2, 22]]

In [94]:
x = [4, None, 'foo']
x.extend([7, 8, (2, 3)])
x

[4, None, 'foo', 7, 8, (2, 3)]

In [95]:
import pandas as pd
from pandas import Series, DataFrame

import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [96]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [101]:
frame #.dtypes

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [109]:
frame.head(1)

   pop state  year
0  1.5  Ohio  2000

In [113]:
pd.DataFrame(data, columns=['year', 'state'])

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada

In [114]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [119]:
'year' in list(frame2.columns)

True

In [123]:
frame2[['state', 'year']]

        state  year
one      Ohio  2000
two      Ohio  2001
three    Ohio  2002
four   Nevada  2001
five   Nevada  2002
six    Nevada  2003

In [122]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [125]:
frame2.loc[['three']]

       year state  pop debt
three  2002  Ohio  3.6  NaN

In [ ]:
frame2.loc[['three']]

In [133]:
frame2.loc['five','pop']

2.9

In [137]:
frame2['debt'] = 16.5

In [135]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [138]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [144]:
obj2 = obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [143]:
obj2

a    1
b    2
c    3
d    0
dtype: int64

In [145]:
obj.sort_index(inplace=True)

In [146]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [147]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [148]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [151]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [152]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [153]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [154]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [156]:
frame.sort_values(by=['b','a'])

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [157]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [158]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [160]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [163]:
obj.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [167]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame
frame.rank()

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

In [165]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [168]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [169]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [171]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [172]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [173]:
df.idxmax()

one    b
two    d
dtype: object

In [174]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [175]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [176]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [177]:
price = pd.read_pickle('pydata-book/examples/yahoo_price.pkl')

In [180]:
price.index

DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
               '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
               '2010-01-14', '2010-01-15',
               ...
               '2016-10-10', '2016-10-11', '2016-10-12', '2016-10-13',
               '2016-10-14', '2016-10-17', '2016-10-18', '2016-10-19',
               '2016-10-20', '2016-10-21'],
              dtype='datetime64[ns]', name='Date', length=1714, freq=None)

In [181]:
volume = pd.read_pickle('pydata-book/examples/yahoo_volume.pkl')

In [182]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
2010-01-11  115557400  14479800   5730400  68754700
2010-01-12  148614900   9742900   8081500  65912100
2010-01-13  151473000  13041800   6455400  51863500
2010-01-14  108223500   8511900   7111800  63228100
2010-01-15  148516900  10909600   8494400  79913200
...               ...       ...       ...       ...
2016-10-10   36236000   1161400   2481300  18196500
2016-10-11   64041000   1368000   2901300  26497400
2016-10-12   37586800    934900   2964000  22177500
2016-10-13   35192400   1300400   2909900  25313700
2016-10-14   35652200    851100   4358200  27402500
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [183]:
returns = price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
2010-01-11 -0.008822 -0.001512 -0.010470 -0.012720
2010-01-12 -0.011375 -0.017684  0.007955 -0.006607
2010-01-13  0.014106 -0.005741 -0.002145  0.009312
2010-01-14 -0.005792  0.004701  0.015972  0.020099
2010-01-15 -0.016712 -0.016699 -0.004006 -0.003230
...              ...       ...       ...       ...
2016-10-10  0.017447  0.014011  0.008672  0.004152
2016-10-11  0.002154 -0.003652 -0.014202 -0.014645
2016-10-12  0.008942  0.003920 -0.003230 -0.001399
2016-10-13 -0.003068 -0.010113 -0.003694 -0.003327
2016-10-14  0.005556  0.000437  0.004749  0.008784
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [184]:
returns['MSFT'].corr(returns['IBM'])

0.49976361144151144

In [185]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [186]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64